{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "dtype": "float32", "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "name": "conv2d_1", "trainable": true, "filters": 62, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 369, 496, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_2", "filters": 31, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_2", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_3", "filters": 16, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_3", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_4", "filters": 9, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [3, 3], "name": "max_pooling2d_4", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 800, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 200, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "units": 100, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "units": 2, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.3"}