{"config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "filters": 62, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_1", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 369, 496, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [3, 3], "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_2", "padding": "valid", "filters": 31, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [3, 3], "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_3", "padding": "valid", "filters": 16, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [3, 3], "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4", "padding": "valid", "filters": 9, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [3, 3], "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_4", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 800, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 200, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 100, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 2, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "beta_constraint": null, "center": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "softmax", "trainable": true}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3"}